app/controllers/auction_posts_controller.rb

SELECT "auction_posts".* FROM "auction_posts"
---
  def index
    @auction_posts = AuctionPost.all

INSERT INTO "auction_posts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-01-12 06:51:09.825985"], ["updated_at", "2018-01-12 06:51:09.825985"]]
---
  def create
    @auction_post = AuctionPost.new(auction_post_params)

    respond_to do |format|
      if @auction_post.save

DELETE FROM "auction_posts" WHERE "auction_posts"."id" = ?  [["id", 2]]
---
  def destroy
    @auction_post.destroy

SELECT  "auction_posts".* FROM "auction_posts" WHERE "auction_posts"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_auction_post
      @auction_post = AuctionPost.find(params[:id])