app/controllers/rent_posts_controller.rb

  def index
    @rent_posts = RentPost.all
---
SELECT "rent_posts".* FROM "rent_posts"

  def create
    @rent_post = RentPost.new(rent_post_params)

    respond_to do |format|
      if @rent_post.save
---
INSERT INTO "rent_posts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-01-12 07:34:48.570483"], ["updated_at", "2018-01-12 07:34:48.570483"]]

    def set_rent_post
      @rent_post = RentPost.find(params[:id])
---
SELECT  "rent_posts".* FROM "rent_posts" WHERE "rent_posts"."id" = ? LIMIT 1  [["id", 1]]